{
  "type": "Degree",
  "name": "A.B.",
  "code": "AB",
  "description": "The A.B. program at Princeton is intended to stretch students' minds and challenge their imaginations--to teach them to think and reason and document and prove, to cast a critical eye on conventional wisdom, to make sense of evidence, to read a text with care and critical insight, to conceptualize and solve problems, and to express themselves clearly and convincingly on paper and in discussion. Working within the general curricular framework, each undergraduate pursuing the A.B. degree is encouraged to develop an academic program in response to personal aspirations and interests. Each student's program of study encompasses a combination of courses that satisfy general education and departmental requirements, and substantial independent work during the junior and senior years.",
  "urls": [
    "https://ua.princeton.edu/contents/program-study-degree-bachelor-arts",
    "https://ua.princeton.edu/contents/general-education-requirements"
  ],
  "req_list": [
    {
      "name": "Degree Progress",
      "max_counted": 1,
      "min_needed": "ALL",
      "explanation": "With the exception of students who receive one or two terms of advanced standing, all A.B. students must successfully complete a minimum of 31 courses and two years of departmental independent work in eight terms of study. An extra term or year of study is granted by the Faculty Committee on Examinations and Standing to a student making normal progress toward the degree only under extraordinary circumstances.\n\nThe normal course load for first-years, sophomores, and juniors is four courses each term, with the exception of one term in the first or sophomore year when a student typically will need to take five courses in order to meet the expectation that 17 courses will have been completed by the start of junior year.\n\nRegardless of the number of courses completed prior to entering senior year, all seniors must, with the exception of the two programs listed below, complete a minimum of six courses in senior year. This is most often accomplished by enrolling in three courses each term but students may take four courses in one term and two courses in the other. Students in the Program in Teacher Preparation who have taken an extra course in an earlier year or a student who is participating in the University Scholar Program may be permitted to reduce their course load by one course in the senior year.",
      "completed_by_semester": 8,
      "req_list": [
        {
          "name": "By first semester",
          "max_counted": 1,
          "explanation": null,
          "completed_by_semester": 1,
          "num_courses": 4
        },
        {
          "name": "By second semester",
          "max_counted": 1,
          "explanation": null,
          "completed_by_semester": 2,
          "num_courses": 8
        },
        {
          "name": "By fourth semester",
          "max_counted": 1,
          "explanation": null,
          "completed_by_semester": 4,
          "num_courses": 17
        },
        {
          "name": "By sixth semester",
          "max_counted": 1,
          "explanation": null,
          "completed_by_semester": 6,
          "num_courses": 25
        },
        {
          "name": "Total courses",
          "max_counted": 1,
          "explanation": null,
          "completed_by_semester": 8,
          "num_courses": 31
        }
      ]
    },
    {
      "name": "Writing Seminar",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "<i>One course, completed in the first year</i>\n\nAll Princeton undergraduates take a Writing Seminar in the Fall or Spring of their first year.\n\nThe Writing Seminars give Princeton first-year students an early opportunity to belong to a lively academic community in which members investigate a shared topic and discuss their writing together, with the aim of clarifying and deepening their thinking. The seminars are interdisciplinary in nature to emphasize transferable reading, writing and research skills. You’ll learn how to frame compelling questions, position your argument within a genuine academic debate, substantiate and organize claims, purposefully integrate a wide variety of sources and revise for greater cogency and clarity.\n\nMore information:\n<a href=\"https://writing.princeton.edu/undergraduates/writing-seminars/fall-seminars\" target=\"_blank\" rel=\"noopener\">https://writing.princeton.edu/undergraduates/writing-seminars/fall-seminars</a>\n\nEnrollment process:\n<a href=\"https://writing.princeton.edu/seminars/how-enroll\" target=\"_blank\" rel=\"noopener\">https://writing.princeton.edu/seminars/how-enroll</a>",
      "pdfs_allowed": false,
      "completed_by_semester": 2,
      "course_list": [
        "WRI 1**"
      ]
    },
    {
      "name": "Foreign Language",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "<i>One to four terms to complete, depending on the language students study and the level at which they start</i>\n\nWhen you become proficient in a foreign language, you acquire more than a communication skill; you become literate in another culture and gain another perspective on the world. All candidates for the A.B. degree at Princeton must demonstrate proficiency in a foreign language before graduation. Many undergraduates satisfy the foreign language requirement by demonstrating proficiency when they enter the University. In order to fulfill the language requirement through coursework, we expect successful completion of courses normally numbered through 107/108. ",
      "double_counting_allowed": false,
      "course_list": [
        "LANG 1027",
        "LANG 107",
        "LANG 108",
        "LANG 2**",
        "LANG 3**",
        "LANG 4**",
        "LANG 5**"
      ]
    },
    {
      "name": "Culture and Difference",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "<i>One course</i>\n\nThe requirement in Culture and Difference (CD) begins with the premise that human beings experience the world through their respective cultures—the ideas, meanings, norms, and habituations – that are represented in the arts and literature, laws and institutions, and social practices of human societies whose histories and power relationships often differ from one another. Found across a wide range of disciplines, these courses use cultural analysis to trace the ways in which human beings construct meaning both within and across groups. Culture and Difference courses offer students a lens through which other forms of disciplinary inquiry are enhanced, critiqued, and clarified, often paying close attention to the experiences and perspectives of groups who have historically been excluded from dominant cultural narratives or structures of social power.\n\nThe requirement in Culture and Difference is the only requirement that may be satisfied either independently or concurrently with another distribution area.",
      "double_counting_allowed": true,
      "dist_req": "CD",
      "year_switch": [
        {
          "year_code": "<=2023",
          "max_counted": 0,
          "min_needed": 0,
          "explanation": "<i>New! Only required for the class of 2024 and later.</i>\n\nThe requirement in Culture and Difference (CD) begins with the premise that human beings experience the world through their respective cultures—the ideas, meanings, norms, and habituations – that are represented in the arts and literature, laws and institutions, and social practices of human societies whose histories and power relationships often differ from one another. Found across a wide range of disciplines, these courses use cultural analysis to trace the ways in which human beings construct meaning both within and across groups. Culture and Difference courses offer students a lens through which other forms of disciplinary inquiry are enhanced, critiqued, and clarified, often paying close attention to the experiences and perspectives of groups who have historically been excluded from dominant cultural narratives or structures of social power.\n\nThe requirement in Culture and Difference is the only requirement that may be satisfied either independently or concurrently with another distribution area.",
        }
      ]
    },
    {
      "name": "Epistemology and Cognition",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "<i>One course</i>\n\nCourses in Epistemology and Cognition (EC) address the nature and limits of human knowledge. The cognitive sciences and related fields study human reasoning as it is. Epistemology — the philosophical theory of knowledge — studies human reasoning as it ought to be. Both areas of inquiry focus simultaneously on the manifold sources of human knowledge and on the many ways in which human reasoning can be distorted or undermined. Courses in this group are offered in a number of departments, but share the common goal of encouraging students to reflect on the linguistic, psychological, and cultural structures that make knowledge possible. Individual departments may also offer courses in disciplinary “ways of knowing” that invite students to consider the epistemological assumptions and methodological principles that inform research in their fields.",
      "dist_req": "EC"
    },
    {
      "name": "Ethical Thought and Moral Values",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "<i>One course</i>\n\nCourses in Ethical Thought and Moral Values (EM) equip students to understand the basis of their own moral reasoning and ethical issues as they arise in social life, while also cultivating the possibility of a common ethical language among people whose traditions and values differ.\n\nHuman beings often disagree about matters of right and wrong, and about how we ought to organize our lives together. The ethical and moral conclusions we reach, however, are not mere matters of opinion. Ethical decisions emerge from fundamental ideas about the nature and possibility of the “good,” our duties and obligations to one another, our aspirations for a virtuous and meaningful life, and the demands of justice. These ideas, often shaped by ancient traditions of religion and culture, guide the moral questions we ask and the conclusions we reach.",
      "dist_req": "EM"
    },
    {
      "name": "Historical Analysis",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "<i>One course</i>\n\nHistorical Analysis (HA) invites students to enter imaginatively into languages, institutions, and worldviews of the past. It grounds us in the awareness that human life and culture are thousands of years old, and that the world we experience in the present is only a fraction of all that it ever was. Fundamental to historical analysis is the study of change over time: why and how did cities rise and fall, technologies develop, the social roles of men and women transform? Because we can never directly experience the past, historical analysis depends on the subjective selection and interpretation of texts, artifacts, and other evidence, and from the same evidence many different stories can often be told. Historical analysis requires students to make critical judgments about the conclusions we can draw from the traces of the past to which we have access.",
      "dist_req": "HA"
    },
    {
      "name": "Literature and the Arts",
      "max_counted": 1,
      "min_needed": 2,
      "explanation": "<i>Two courses</i>\n\nIn courses in Literature and the Arts (LA), students may produce creative, imaginative works or practice interpreting them. For example, they may choreograph dances or read Shakespeare plays or create performance pieces that use imaginative and interpretive skills critically and physically. The skill of “close reading” is especially important in this area of inquiry: what can we learn from careful attention to the precise words, colors, or tones that an artist has chosen?\n\nHuman beings have always used imagination to create reflections and representations of ourselves and our world, from cave paintings to symphonies to video games. In making these artistic or imaginative representations, we express ideas about our own nature and investigate the nature of the world around us, often in ways that push at the boundaries of what can be said in ordinary language.",
      "dist_req": "LA"
    },
    {
      "name": "Social Analysis",
      "max_counted": 1,
      "min_needed": 2,
      "explanation": "<i>Two courses</i>\n\nSocial Analysis (SA) involves the study of the structures, processes, and meanings human beings create through our interactions with one another, and the networks and institutions through which human behavior develops and evolves. The codes and narratives we share with others, often unspoken, produce our sense of “the normal” and structure our thought and behavior. These components of social life are accessible through both quantitative methods, which involve the statistical analysis of data, and qualitative methods, which rely on the interpretation of data gathered through observation and interaction. Social analysis enables us to make sense of the social structures and processes that shape individual lives, to understand the role of institutions—such as the family, government, schools, and labor markets—in society, and to define and respond to social problems, such as inequality and violence.",
      "dist_req": "SA"
    },
    {
      "name": "Quantitative and Computational Reasoning",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "<i>One course</i>\n\nQuantitative and Computational Reasoning (QCR) engages students in the logic of mathematics and the manipulation of numerical and categorical information. Quantitative reasoning asks us to describe and predict things that can be measured or counted such as population, speed, or cost. Computational thinking informs the underlying structures of the codes and algorithms created in computer science. Quantitative and computational reasoning is used to some degree in almost every area of learning. A strong foundation in quantitative reasoning helps students think clearly and apply quantitative methods to a wide range of projects, and equips them to critically evaluate statistical claims.",
      "dist_req": [
        "QR",
        "QCR"
      ]
    },
    {
      "name": "Science and Engineering",
      "max_counted": 1,
      "min_needed": 2,
      "explanation": "<i>Two courses. At least one course must be a science and engineering course with laboratory (SEL).</i>\n\nScience and Engineering (SEL/SEN) encompass the study of the natural and constructed worlds, their impact on humanity, and the human impact on them. These disciplines teach principles, methods, and systematic thinking, how to innovate theories and methodologies, how to test hypotheses and prototypes by analyzing data while managing uncertainty, and how to enhance the built world through creativity and design. Fundamental to science and engineering are the methods and habits of mind in which models are developed, critiqued, and refined, thereby enriching and expanding our ways of understanding – and fascination with – the natural and constructed environments, and our own positions within them.\n\nAt least one course must be a science and engineering course with laboratory (SEL). Students may elect a second laboratory science course, or a nonlaboratory science course (SEN).",
      "req_list": [
        {
          "name": "Science and Engineering with Lab",
          "max_counted": null,
          "min_needed": 1,
          "explanation": "Science and Engineering with Lab (SEL)",
          "dist_req": [
            "STL",
            "SEL"
          ]
        },
        {
          "name": "Science and Engineering without Lab",
          "max_counted": 1,
          "min_needed": null,
          "explanation": "Science and Engineering without Lab (SEN)",
          "dist_req": [
            "STN",
            "SEN"
          ]
        }
      ]
    }
  ]
}