{
  "type": "Degree",
  "name": "B.S.E.",
  "code": "BSE",
  "description": "The B.S.E. program at Princeton is intended to educate future leaders in many different areas – including engineering practice and research, business and finance, public service, and other professions – through the teaching of fundamental engineering principles and techniques with their applications to modern problems in a global societal context. To this end, B.S.E. students are challenged to conceptualize and solve technical problems, work together in teams, express themselves clearly and convincingly, evaluate evidence critically, and appreciate the ethical, social, economic, and cultural environments in which they will live and work.",
  "urls": [
    "https://ua.princeton.edu/contents/program-study-degree-bachelor-science-engineering",
    "https://ua.princeton.edu/contents/general-education-requirements",
    "https://lsi.princeton.edu/integratedscience/freshman-year",
    "https://engineering.princeton.edu/undergraduate-studies/first-year-advising/degree-requirements"
  ],
  "req_list": [
    {
      "name": "Degree Progress",
      "max_counted": 1,
      "min_needed": "ALL",
      "explanation": "B.S.E. students enroll in four courses for the first term of the freshman year and in four or five courses in each succeeding term, following a sequence appropriate to their individual programs. The school requirement for the B.S.E. degree is at least 36 courses in the four years of study. Sophomores, juniors, and seniors must complete at least four courses each term, with a minimum of 17 courses by the start of junior year and 26 courses by the start of senior year.",
      "req_list": [
        {
          "name": "By first semester",
          "max_counted": 1,
          "explanation": null,
          "completed_by_semester": 1,
          "num_courses": 4
        },
        {
          "name": "By second semester",
          "max_counted": 1,
          "explanation": null,
          "completed_by_semester": 2,
          "num_courses": 8
        },
        {
          "name": "By fourth semester",
          "max_counted": 1,
          "explanation": null,
          "completed_by_semester": 4,
          "num_courses": 17
        },
        {
          "name": "By sixth semester",
          "max_counted": 1,
          "explanation": null,
          "completed_by_semester": 6,
          "num_courses": 26
        },
        {
          "name": "Total courses",
          "max_counted": 1,
          "explanation": null,
          "completed_by_semester": 8,
          "num_courses": 36
        }
      ]
    },
    {
      "name": "Mathematics",
      "max_counted": 1,
      "min_needed": 4,
      "explanation": "<i>Four semesters</i>",
      "pdfs_allowed": false,
      "double_counting_allowed": true,
      "req_list": [
        {
          "name": "First Term Math",
          "max_counted": 1,
          "min_needed": 1,
          "explanation": "<i>Must be completed by the end of the first year</i>\n\n103 Calculus",
          "completed_by_semester": 2,
          "course_list": [
            "MAT 103"
          ]
        },
        {
          "name": "Second Term Math",
          "max_counted": 1,
          "min_needed": 1,
          "explanation": "<i>Must be completed by the end of the first year</i>\n\n104 Calculus",
          "completed_by_semester": 2,
          "course_list": [
            "MAT 104",
            "EGR 152"
          ]
        },
        {
          "name": "Third Term Math",
          "max_counted": 1,
          "min_needed": 1,
          "explanation": "201 Multivariable Calculus, 203 Advanced Multivariable Calculus, 218 Analysis in Several Variables, or EGR 192 Integrated Introduction to Engineering, Mathematics, Physics",
          "course_list": [
            "MAT 201",
            "MAT 203",
            "MAT 216",
            "MAT 218",
            "EGR 192",
            "EGR 156"
          ]
        },
        {
          "name": "Fourth Term Math",
          "max_counted": 1,
          "min_needed": 1,
          "explanation": "202 Linear Algebra with Applications, 204 Advanced Linear Algebra with Applications, or 217 Honors Linear Algebra, or equivalent",
          "course_list": [
            "MAT 202",
            "MAT 204",
            "MAT 217",
            "EGR 154"
          ]
        }
      ]
    },
    {
      "name": "Physics",
      "max_counted": 1,
      "min_needed": 2,
      "explanation": "<i>Two semesters, must be completed by the end of the first year</i>",
      "pdfs_allowed": false,
      "double_counting_allowed": true,
      "completed_by_semester": 2,
      "req_list": [
        {
          "name": "Mechanics",
          "max_counted": 1,
          "min_needed": 1,
          "explanation": "103 General Physics, 105 Advanced Physics, or EGR 191 Integrated Introduction to Engineering, Mathematics, Physics",
          "course_list": [
            "PHY 103",
            "PHY 105",
            "EGR 191",
            "EGR 151"
          ]
        },
        {
          "name": "Electromagnetism",
          "max_counted": 1,
          "min_needed": 1,
          "explanation": "104 General Physics or 106 Advanced Physics, or equivalent",
          "course_list": [
            "PHY 104",
            "PHY 106",
            "EGR 193",
            "EGR 153"
          ]
        },
        {
          "name": null,
          "max_counted": 2,
          "min_needed": "ALL",
          "explanation": null,
          "course_list": [
            "ISC 231",
            "ISC 232",
            "ISC 233",
            "ISC 234"
          ]
        }
      ]
    },
    {
      "name": "Chemistry",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "<i>One semester, must be completed by the end of the first year</i>\n\n207 Advanced General Chemistry: Materials Chemistry, or 201 General Chemistry, or equivalent",
      "pdfs_allowed": false,
      "double_counting_allowed": true,
      "completed_by_semester": 2,
      "req_list": [
        {
          "name": null,
          "max_counted": 1,
          "min_needed": null,
          "explanation": null,
          "course_list": [
            "CHM 201",
            "CHM 201A",
            "CHM 203",
            "CHM 207"
          ]
        },
        {
          "name": null,
          "max_counted": 1,
          "min_needed": "ALL",
          "explanation": null,
          "course_list": [
            "ISC 231",
            "ISC 232",
            "ISC 233",
            "ISC 234"
          ]
        }
      ]
    },
    {
      "name": "Computer Science",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "<i>One semester, must be completed by the end of the second year</i>\n\nComputer proficiency is a requirement for the B.S.E. degree fulfilled by taking COS 126 General Computer Science. This requirement must be satisfied before the beginning of the junior year. This requirement may not be satisfied by a course taken under the pass/D/fail option. A course taken at another school may not be used to satisfy this requirement.",
      "pdfs_allowed": false,
      "double_counting_allowed": true,
      "completed_by_semester": 4,
      "req_list": [
        {
          "name": null,
          "max_counted": 1,
          "min_needed": null,
          "explanation": null,
          "course_list": [
            "COS 126",
            "COS 217",
            "COS 226"
          ]
        },
        {
          "name": null,
          "max_counted": 1,
          "min_needed": "ALL",
          "explanation": null,
          "course_list": [
            "ISC 231",
            "ISC 232",
            "ISC 233",
            "ISC 234"
          ]
        }
      ]
    },
    {
      "name": "Writing Seminar",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "<i>One course, completed in the first year</i>\n\nAll Princeton undergraduates take a Writing Seminar in the Fall or Spring of their first year.\n\nThe Writing Seminars give Princeton first-year students an early opportunity to belong to a lively academic community in which members investigate a shared topic and discuss their writing together, with the aim of clarifying and deepening their thinking. The seminars are interdisciplinary in nature to emphasize transferable reading, writing and research skills. You’ll learn how to frame compelling questions, position your argument within a genuine academic debate, substantiate and organize claims, purposefully integrate a wide variety of sources and revise for greater cogency and clarity.\n\nMore information:\n<a href=\"https://writing.princeton.edu/undergraduates/writing-seminars/fall-seminars\" target=\"_blank\" rel=\"noopener\">https://writing.princeton.edu/undergraduates/writing-seminars/fall-seminars</a>\n\nEnrollment process:\n<a href=\"https://writing.princeton.edu/seminars/how-enroll\" target=\"_blank\" rel=\"noopener\">https://writing.princeton.edu/seminars/how-enroll</a>",
      "pdfs_allowed": false,
      "completed_by_semester": 2,
      "course_list": [
        "WRI 1**"
      ]
    },
    {
      "name": "Humanities and Social Sciences",
      "max_counted": 1,
      "min_needed": 2,
      "explanation": "<i>7 total courses in 4 areas</i>",
      "pdfs_allowed": true,
      "req_list": [
        {
          "name": "Four Areas",
          "max_counted": 1,
          "min_needed": 4,
          "explanation": "The humanities and social science courses must include one course in four of the six areas listed below.",
          "req_list": [
            {
              "name": "Culture and Difference",
              "max_counted": 1,
              "min_needed": null,
              "explanation": "The requirement in Culture and Difference (CD) begins with the premise that human beings experience the world through their respective cultures—the ideas, meanings, norms, and habituations – that are represented in the arts and literature, laws and institutions, and social practices of human societies whose histories and power relationships often differ from one another. Found across a wide range of disciplines, these courses use cultural analysis to trace the ways in which human beings construct meaning both within and across groups. Culture and Difference courses offer students a lens through which other forms of disciplinary inquiry are enhanced, critiqued, and clarified, often paying close attention to the experiences and perspectives of groups who have historically been excluded from dominant cultural narratives or structures of social power.",
              "dist_req": "CD",
              "year_switch": [
                {
                  "year_code": "<=2023",
                  "name": null,
                  "no_req": null,
                  "explanation": "Only for the class of 2024 and later.",
                }
              ]
            },
            {
              "name": "Epistemology and Cognition",
              "max_counted": 1,
              "min_needed": null,
              "explanation": "Courses in Epistemology and Cognition (EC) address the nature and limits of human knowledge. The cognitive sciences and related fields study human reasoning as it is. Epistemology — the philosophical theory of knowledge — studies human reasoning as it ought to be. Both areas of inquiry focus simultaneously on the manifold sources of human knowledge and on the many ways in which human reasoning can be distorted or undermined. Courses in this group are offered in a number of departments, but share the common goal of encouraging students to reflect on the linguistic, psychological, and cultural structures that make knowledge possible. Individual departments may also offer courses in disciplinary “ways of knowing” that invite students to consider the epistemological assumptions and methodological principles that inform research in their fields.",
              "dist_req": "EC"
            },
            {
              "name": "Ethical Thought and Moral Values",
              "max_counted": 1,
              "min_needed": null,
              "explanation": "Courses in Ethical Thought and Moral Values (EM) equip students to understand the basis of their own moral reasoning and ethical issues as they arise in social life, while also cultivating the possibility of a common ethical language among people whose traditions and values differ.\n\nHuman beings often disagree about matters of right and wrong, and about how we ought to organize our lives together. The ethical and moral conclusions we reach, however, are not mere matters of opinion. Ethical decisions emerge from fundamental ideas about the nature and possibility of the “good,” our duties and obligations to one another, our aspirations for a virtuous and meaningful life, and the demands of justice. These ideas, often shaped by ancient traditions of religion and culture, guide the moral questions we ask and the conclusions we reach.",
              "dist_req": "EM"
            },
            {
              "name": "Foreign Language",
              "max_counted": 1,
              "min_needed": null,
              "explanation": "<i>A Romance language course at the 107/108 level or above or a non-Romance language course at the 105 level or above</i>\n\nWhen you become proficient in a foreign language, you acquire more than a communication skill; you become literate in another culture and gain another perspective on the world.",
              "course_list": [
                "GER 1025",
                "LANG 1027",
                "LANG 105",
                "LANG 107",
                "LANG 108",
                "LANG 2**",
                "LANG 3**",
                "LANG 4**",
                "LANG 5**"
              ],
              "excluded_course_list": [
                "FRE 105",
                "ITA 105",
                "POR 105",
                "SPA 105"
              ]
            },
            {
              "name": "Historical Analysis",
              "max_counted": 1,
              "min_needed": null,
              "explanation": "Historical Analysis (HA) invites students to enter imaginatively into languages, institutions, and worldviews of the past. It grounds us in the awareness that human life and culture are thousands of years old, and that the world we experience in the present is only a fraction of all that it ever was. Fundamental to historical analysis is the study of change over time: why and how did cities rise and fall, technologies develop, the social roles of men and women transform? Because we can never directly experience the past, historical analysis depends on the subjective selection and interpretation of texts, artifacts, and other evidence, and from the same evidence many different stories can often be told. Historical analysis requires students to make critical judgments about the conclusions we can draw from the traces of the past to which we have access.",
              "dist_req": "HA"
            },
            {
              "name": "Literature and the Arts",
              "max_counted": 1,
              "min_needed": null,
              "explanation": "In courses in Literature and the Arts (LA), students may produce creative, imaginative works or practice interpreting them. For example, they may choreograph dances or read Shakespeare plays or create performance pieces that use imaginative and interpretive skills critically and physically. The skill of “close reading” is especially important in this area of inquiry: what can we learn from careful attention to the precise words, colors, or tones that an artist has chosen?\n\nHuman beings have always used imagination to create reflections and representations of ourselves and our world, from cave paintings to symphonies to video games. In making these artistic or imaginative representations, we express ideas about our own nature and investigate the nature of the world around us, often in ways that push at the boundaries of what can be said in ordinary language.",
              "dist_req": "LA"
            },
            {
              "name": "Social Analysis",
              "max_counted": 1,
              "min_needed": null,
              "explanation": "Social Analysis (SA) involves the study of the structures, processes, and meanings human beings create through our interactions with one another, and the networks and institutions through which human behavior develops and evolves. The codes and narratives we share with others, often unspoken, produce our sense of “the normal” and structure our thought and behavior. These components of social life are accessible through both quantitative methods, which involve the statistical analysis of data, and qualitative methods, which rely on the interpretation of data gathered through observation and interaction. Social analysis enables us to make sense of the social structures and processes that shape individual lives, to understand the role of institutions—such as the family, government, schools, and labor markets—in society, and to define and respond to social problems, such as inequality and violence.",
              "dist_req": "SA"
            }
          ]
        },
        {
          "name": "Seven Total Courses",
          "max_counted": 1,
          "min_needed": 7,
          "explanation": "Candidates for the B.S.E. degree must take a minimum of seven courses in the humanities and social sciences.",
          "double_counting_allowed": true,
          "dist_req": [
            "CD",
            "EC",
            "EM",
            "HA",
            "LA",
            "SA"
          ],
          "course_list": [
            "GER 1025",
            "LANG 1027",
            "LANG 105",
            "LANG 107",
            "LANG 108",
            "LANG 2**",
            "LANG 3**",
            "LANG 4**",
            "LANG 5**"
          ],
          "excluded_course_list": [
            "FRE 105",
            "ITA 105",
            "POR 105",
            "SPA 105"
          ],
          "year_switch": [
            {
              "year_code": "<=2023",
              "dist_req": [
                "EC",
                "EM",
                "HA",
                "LA",
                "SA"
              ]
            }
          ]
        }
      ]
    }
  ]
}
