{
    "type": "Certificate",
    "name": "Program in Engineering Biology",
    "code": "PEB",
    "degree": null,
    "description" : "The Program in Engineering Biology is designed for those highly motivated students who are interested in pursuing careers or graduate education in the areas of biotechnology or bioengineering. The interface between engineering science and the life sciences is an area of dramatic growth and intellectual vigor. Innovations and new developments in this area require multidisciplinary approaches and greater exposure to life science and engineering science fundamentals than is available from a single department. For engineering majors, in addition to courses in those subjects fundamental to the student's major, the program encourages the study of cellular and molecular biology, genetics, physiology, biochemistry, and neuroscience. For biological and chemical sciences majors, the program offers study in biotechnology, biomechanics, thermodynamics, control theory, hazardous waste management, electronics, computer graphics, and information theory.",
    "urls": [
        "https://ua.princeton.edu/academic-units/program-engineering-biology",
        "http://www.princeton.edu/engbio/info/"
    ],
    "allowed_majors": [
        "ORF",
        "ELE",
        "MAE",
        "COS",
        "CEE",
        "CBE"
    ],
    "contacts": [
        {
            "type": "Program Administrator",
            "name": "Julie Sefa",
            "email": "cbeug@princeton.edu"
        }
    ],
    "req_list": [
        {
            "name": "Life Sciences Courses Requirement",
            "min_needed": 5,
            "description": "The basic principle is that students from the Life Sciences (Molecular Biology or Ecology and Evolutionary Biology) have to take five Engineering School Courses; and students from any of the Engineering Departments have to take five courses from a Life Science Department.",
            "explanation": "Any course in Molecular Biology or Ecology and Evolutionary Biology counts. Cross-listed courses count if they have significant biology content.For Engineering students whose Department does not require Organic Chemistry (i.e. all other than Chemical and Biological Engineering) then the two course Organic Chemistry sequence counts as two life science course. ISC 231-232 An Integrated, Quantitative Introduction to the Natural Sciences. The two course ISC sequence, ISC 231 and ISC 232 counts as 1 life science course.ISC 233-234 An Integrated, Quantitative Introduction to the Natural Sciences II The two course ISC sequence, ISC 233 and ISC 234 counts as 1 life science course. ISC 235 An Integrated, Quantitative Introduction to the Natural Science III (counts as 1 life science course) ISC 236 An Integrated, Quantitative Introduction to the Natural Science IV (counts as 1 life science course)",
            "double_counting_allowed": false,
            "pdfs_allowed": 0,
            "course_list": [
                "EEB 211",
                "EEB 308",
                "EEB 309",
                "EEB 311A",
                "EEB 321",
                "EEB 327",
                "EEB 329",
                "EEB 504",
                "EEB 507",
                "ENV 304",
                "MOL 214",
                "QCB 515",
                "ANT 206B",
                "EEB 324",
                "EEB 328",
                "EEB 332",
                "EEB 338",
                "EEB 346",
                "EEB 380",
                "EEB 384",
                "EEB 403",
                "EEB 404",
                "EEB 506",
                "EEB 521",
                "EEB 522",
                "EEB 538",
                "ENV 302",
                "GHP 351",
                "GHP 400",
                "ISC 326",
                "CHM 542",
                "ISC 233",
                "ISC 234",
                "MAT 586",
                "MOL 101",
                "MOL 320",
                "MOL 340",
                "MOL 342",
                "MOL 345",
                "MOL 348",
                "MOL 350",
                "MOL 380",
                "MOL 432",
                "MOL 425",
                "MOL 431",
                "MOL 458",
                "MOL 459",
                "MOL 460",
                "MOL 475",
                "MOL 504",
                "MOL 506",
                "MOL 514",
                "MOL 518",
                "MOL 523",
                "MOL 540",
                "MOL 541",
                "MOL 558",
                "MOL 559",
                "MOL 561",
                "MOL 575",
                "NEU 301",
                "NEU 501A",
                "NEU 502A",
                "NEU 502B",
                "QCB 455",
                "STC 297",
                "COS 551",
                "PSY 208",
                "PSY 256",
                "NEU 258",
                "NEU 258A",
                "NEU 258B",
                "PSY 406",
                "PSY 407",
                "CBE 262",
                "CBE 419",
                "CBE 423",
                "CBE 433",
                "CBE 438",
                "CBE 439",
                "CBE 440",
                "CBE 447",
                "CBE 534",
                "CBE 304",
                "CHM 345",
                "CHM 448",
                "CHM 515",
                "CHM 516",
                "CHM 525",
                "CHM 538",
                "COS 445",
                "ELE 571",
                "ENE 418",
                "MAE 344",
                "QCB 301",
                "QCB 511"
            ]
        }
    ]
}