{
    "type": "Certificate",
    "name": "History and the Practice of Diplomacy",
    "code": "HPD",
    "degree": null,
    "year": 2018,
    "description": "The undergraduate certificate program will provide preparation for careers in governmental and nongovernmental organizations (NGOs) that preserve stability and improve lives around the world. In addition to requiring courses in the Woodrow Wilson School and the Department of History, the interdisciplinary program will provide students with the opportunity to take applicable classes from politics and other social sciences, as well as those exploring particular regions of the world, such as Near Eastern studies and East Asian studies. Students of any major may pursue the certificate.",
    "urls": [
        "https://ua.princeton.edu/academic-units/program-history-and-practice-diplomacy",
        "https://hpd.princeton.edu/"
    ],
    "contacts": [
        {
            "type": "Co-Director",
            "name": "Stephen Kotkin",
            "email": "kotkin@princeton.edu"
        },
        {
            "type": "Co-Director",
            "name": "Michael Mullen",
            "email": "mgmullen@princeton.edu"
        }
    ],
    "req_list": [
        {
            "name": "Core Course",
            "max_counted": 1,
            "min_needed": 1,
            "explanation": "The core course WWS 315/ POL 393 for the History and the Practice of Diplomacy Certificate.",
            "double_counting_allowed": false,
            "max_common_with_major": 0,
            "pdfs_allowed": 0,
            "course_list": [
                "WWS 315"
            ]
        },
        {
            "name": "Internship",
            "max_counted": 0,
            "min_needed": 0,
            "explanation": "An internship, usually during a summer, with a suitable government agency or nongovernmental organization (NGO), domestic or international.  An internship could include research in think tanks as well as activities described as people to people diplomacy.",
            "double_counting_allowed": false,
            "no_req": null
        },
        {
            "name": "Elective Courses",
            "min_needed": 4,
            "explanation": "Four additional courses: two be in the history department in international, global, diplomatic history, or ancient history, and two in the Woodrow Wilson School, politics department, or other departments, on subjects such as international relations, international organizations, international political economy, security studies, war, peace, the environment and sustainability, global stability.",
            "double_counting_allowed": false,
            "max_common_with_major": 0,
            "pdfs_allowed": 0,
            "course_list": [
                "WWS ***",
                "HIS ***"
            ]
        }
    ]
}
