{
  "type": "Major",
  "name": "Anthropology",
  "code": "ANT",
  "degree": "AB",
  "year": 2018,
  "urls": [
    "https://ua.princeton.edu/academic-units/department-department-anthropology",
    "https://anthropology.princeton.edu/undergraduate/majoring-anthropology"
  ],
  "contacts": [
    {
      "type": "Chair",
      "name": "Carolyn M. Rouse",
      "email": "crouse@princeton.edu"
    },
    {
      "type": "Acting Chair",
      "name": "Serguei A. Oushakine",
      "email": "oushakin@princeton.edu"
    },
    {
      "type": "Director of Undergraduate Studies",
      "name": "Ryo Morimoto",
      "email": "ryo.morimoto@princeton.edu"
    }
  ],
  "req_list": [
    {
      "name": "Prerequisites",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "Students who wish to concentrate in anthropology must take one anthropology course (any level) prior to junior year or have permission from the departmental representative.",
      "double_counting_allowed": true,
      "course_list": [
        "ANT *"
      ]
    },
    {
      "name": "Track",
      "max_counted": 1,
      "min_needed": 1,
      "explanation": "Anthropology concentrators must take nine departmental courses, including the core courses ANT 300 (Ethnography, Evidence and Experience) and ANT 301 (The Ethnographer's Craft). All concentrators are required to participate in a senior seminar the fall semester of their senior year. The seminar is designed to help students write their senior theses.",
      "req_list": [
        {
          "name": "Socio-Cultural Anthropology",
          "max_counted": 1,
          "min_needed": "ALL",
          "explanation": "The Socio-Cultural Anthropology Track (SCA) is for students who want to explore a number of foundational topics within the field of anthropology (e.g. religion, gender, ritual, language, medicine, politics, economics, kinship, psychology, visual anthropology, law). In addition to exploring a variety of topics, students in this track are deeply immersed in the history of the discipline.",
          "req_list": [
            {
              "name": "Required Courses",
              "max_counted": 1,
              "min_needed": "ALL",
              "explanation": null,
              "req_list": [
                {
                  "name": null,
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": null,
                  "course_list": [
                    "ANT 300*"
                  ]
                },
                {
                  "name": null,
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": null,
                  "course_list": [
                    "ANT 301*"
                  ]
                },
                {
                  "name": null,
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": null,
                  "course_list": [
                    "ANT 390*"
                  ]
                }
              ]
            },
            {
              "name": "Electives",
              "max_counted": 1,
              "min_needed": "ALL",
              "explanation": "Two foundational 200-level courses (one may be a cognate approved at this level)\r\nOne 300-level course in addition to 300, 301, 390 (may be a cognate approved at this level)\r\nOne advanced 400-level topical course (may be a cognate approved at this level)\r\nTwo free electives (may be another ANT course at any level and/or a cognate)",
              "double_counting_allowed": false,
              "req_list": [
                {
                  "name": "200-level",
                  "max_counted": 1,
                  "min_needed": 2,
                  "explanation": null,
                  "course_list": [
                    "ANT 2*"
                  ]
                },
                {
                  "name": "300-level",
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": null,
                  "excluded_course_list": [
                    "ANT 300*",
                    "ANT 301*",
                    "ANT 390*"
                  ],
                  "course_list": [
                    "ANT 3*"
                  ]
                },
                {
                  "name": "400-level",
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": null,
                  "course_list": [
                    "ANT 4*"
                  ]
                },
                {
                  "name": "Electives",
                  "max_counted": 1,
                  "min_needed": 2,
                  "explanation": null,
                  "excluded_course_list": [
                    "ANT 300*",
                    "ANT 301*",
                    "ANT 390*"
                  ],
                  "course_list": [
                    "ANT *"
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Medical Anthropology",
          "max_counted": 1,
          "min_needed": "ALL",
          "explanation": "The Medical Anthropology Track (MedAnth is for students interested in all aspects of medicine, from biology to therapeutic systems to cultural ideas and practices of health and wellbeing. Choosing this track allows students who are interested in the sciences, policy, the humanities and the sub-field of medical anthropology to focus their undergraduate training around these topics. The track requires nine courses total; four are required and the other five electives include departmental courses focused on the mind, body or health systems/structures (see examples from list below). Students in this track are allowed to substitute one of the five elective courses with a class taught within the Department of Anthropology but outside MedAnth. Students are also allowed to take two cognates as part of their five elective courses.",
          "req_list": [
            {
              "name": "Required Courses",
              "max_counted": 1,
              "min_needed": "ALL",
              "explanation": null,
              "req_list": [
                {
                  "name": "Foundational Course",
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": "ANT 240 Medical Anthropology or ANT 340 Medicine and the Humanities or ANT 461 Disability, Difference, and Race or another approved foundational course. ANT 235, Medical Humanities, in Spring 2018, satisfies this requirement. Students who have taken ANT 235 may also take ANT 340 and ANT 461 as elective courses, but not ANT 240, as Medical Humanities (ANT 235) is considered equivalent to Medical Anthropology (ANT 240).",
                  "course_list": [
                    "ANT 240",
                    "ANT 340",
                    "ANT 461"
                  ]
                },
                {
                  "name": "Human Evolution",
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": "A course on Human Evolution or ANT 215 Human Adaptation or ANT 309 Forensic Anthropology or ANT 201 (beginning Fall 2020) or a cognate¹ biological course. Note: The department will accept Evolutionary Biology (EEB 309) and Life on Earth (EEB 211/MOL 211) as cognates if taken in AY 2019 to AY 2021 by students declaring the ANT concentration in Spring 2020 or earlier. These courses may be used to substitute for a required biological anthropology course offered by the Anthropology Department.",
                  "course_list": [
                    "ANT 215",
                    "ANT 309",
                    "ANT 201",
                    "EEB 309",
                    "EEB 211/MO"
                  ]
                },
                {
                  "name": "Ethnography, Evidence, and Experience",
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": null,
                  "course_list": [
                    "ANT 300*"
                  ]
                },
                {
                  "name": "The Ethnographer's Craft",
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": null,
                  "course_list": [
                    "ANT 301*"
                  ]
                }
              ]
            },
            {
              "name": "Electives",
              "max_counted": 1,
              "min_needed": 5,
              "explanation": "Elective courses are typically taught every other year, although some may be offered annually and others less frequently. A list of pre-approved MedAnth courses will be published each semester before course enrollment begins.\n\nMedAnth students are allowed to take two cognates (as defined under Program of Study above). A department cognate for a MedAnth student might include a course taught in departments or programs such as the History of Science, African American Studies, Gender and Sexuality Studies, Sociology, Psychology, Molecular Biology, Engineering, Global Health, regional studies classes including AMS, EAS, LAS, NES, courses taken during study abroad and/or anthropology courses taught outside the Medical Anthropology Track.",
              "req_list": [
                {
                  "name": null,
                  "max_counted": null,
                  "explanation": null,
                  "course_list": [
                    "ANT 201",
                    "ANT 206",
                    "ANT 215",
                    "ANT 219",
                    "ANT 235",
                    "ANT 240",
                    "GSS 203/ANT 243",
                    "ANT 272",
                    "ANT 305",
                    "ANT 309A",
                    "ANT 309B",
                    "EAS 312/ANT 312",
                    "ANT 331",
                    "ANT 340",
                    "ANT 360",
                    "GHP 304/ANT 376",
                    "AAS 302/ANT 378",
                    "GHP 350/ANT 380",
                    "WWS 375/ANT 388",
                    "ANT 405",
                    "ANT 442",
                    "ANT 446",
                    "ANT 461"
                  ]
                },
                {
                  "name": null,
                  "max_counted": 2,
                  "min_needed": null,
                  "explanation": null,
                  "course_list": [
                    "CLA 231",
                    "SLA 368"
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Law, Politics, and Economics",
          "max_counted": 1,
          "min_needed": "ALL",
          "explanation": "The Law, Politics, and Economics Track (LPE is for students interested in three well-established fields within the discipline of anthropology. Students in this track are introduced to comparative studies of law, politics, development, and microeconomics (what anthropologists call exchange) across cultures. This track requires nine courses total; three are required and the other six include departmental electives focused on the law, economics and politics (see examples from list below). Students in this track are allowed to substitute one of the six elective courses with a class taught within the Department of Anthropology but outside the LPE track. Students are also allowed to take two cognates as part of their six elective courses.",
          "req_list": [
            {
              "name": "Required Courses",
              "max_counted": 1,
              "min_needed": "ALL",
              "explanation": null,
              "req_list": [
                {
                  "name": null,
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": null,
                  "course_list": [
                    "ANT 300*"
                  ]
                },
                {
                  "name": null,
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": null,
                  "course_list": [
                    "ANT 301*"
                  ]
                },
                {
                  "name": null,
                  "max_counted": 1,
                  "min_needed": 1,
                  "explanation": null,
                  "course_list": [
                    "ANT 390*"
                  ]
                }
              ]
            },
            {
              "name": "Electives",
              "max_counted": 1,
              "min_needed": 6,
              "explanation": "These courses are typically taught every other year, although some may be offered annually and others less frequently. A list of pre-approved LPE courses will be published each semester before course enrollment begins.\n\nLPE students are allowed to take two cognates (as defined under Program of Study above). Appropriate cognates for LPE might include Introduction to Microeconomics (ECO 100), a course taught in the Politics Department, a regional studies course, courses taken during study abroad and/or anthropology courses taught outside the Law, Politics, and Economics track.",
              "req_list": [
                {
                  "name": null,
                  "max_counted": null,
                  "explanation": null,
                  "course_list": [
                    "ANT 201",
                    "ANT 203",
                    "ANT 219",
                    "ANT 223",
                    "ANT 225",
                    "ANT 227",
                    "ANT 231",
                    "ANT 232",
                    "ANT 246",
                    "ANT 272",
                    "ANT 304",
                    "ANT 306",
                    "ANT 309A",
                    "ANT 314",
                    "ANT 319",
                    "EAS 225/ANT 323",
                    "ANT 336",
                    "ANT 337",
                    "LAS 217/ANT 339",
                    "ANT 342",
                    "ANT 363",
                    "ANT 369",
                    "AAS 302/ANT 378",
                    "AFS 205/ANT 384",
                    "EGR 385/ANT 385",
                    "LAS 307/ANT 387",
                    "NES 391/ANT 391",
                    "ANT 405",
                    "ANT 406",
                    "ANT 407",
                    "ANT 419",
                    "ANT 421",
                    "ANT 434",
                    "ANT 446",
                    "ANT 452",
                    "ANT 453",
                    "ANT 461",
                    "LAS 486/ANT 486"
                  ]
                },
                {
                  "name": null,
                  "max_counted": 2,
                  "min_needed": null,
                  "explanation": null,
                  "course_list": [
                    "LAS 218",
                    "LAS 313"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Independent Work",
      "max_counted": null,
      "min_needed": null,
      "explanation": "<i>Editor's Note: Concentrators of this major do not enroll in any numbered course for this requirement, so TigerPath does not check it.</i>\n\nIndependent work in the junior year involves an original paper, usually based on library research. Normally, field research is not appropriate for this paper. In the fall, students develop a detailed problem statement and annotated bibliography on a subject relevant to the student's interests, as a research proposal for approval by the department. In the spring, students write a paper based on the research initiated in the fall, in consultation with their adviser. Since the junior paper topic is chosen before the deadline for declaring a track, junior papers, unlike senior theses, do not have to be related to a student’s chosen track. Junior independent work, regardless of track, is meant to teach students how to do a review of the anthropological literatures related to a student’s area of interest.",
      "description": "Independent Work",
      "no_req": null
    },
    {
      "name": "Senior Thesis",
      "max_counted": null,
      "min_needed": null,
      "explanation": "<i>Editor's Note: Concentrators of this major do not enroll in any numbered course for this requirement, so TigerPath does not check it.</i>\n\nIn the senior year, the independent work consists of a thesis, or a comparable project including a substantial written component, on a subject relevant to the student's interests and approved by the department. Field work is encouraged but not required. The required senior seminar is designed to support seniors' independent work during the fall term. Students enrolled in ANT 390B during their senior year are automatically enrolled in the senior seminar; students not taking ANT 390B during senior year will also enroll in the senior seminar by individual arrangement with the department.",
      "description": "Senior Thesis",
      "no_req": null
    }
  ]
}
